//
//  UnitModelPL.m
//  FyhNewProj
//
//  Created by yh f on 2017/11/2.
//  Copyright © 2017年 fyh. All rights reserved.
//

#import "UnitModelPL.h"

@implementation UnitModelPL


//        unitArr = @[@"",@"",@"",@"",@"",@"",@"",@""];

+ (NSArray *)returnArrWithUnitName:(NSString *)unitName{  //成分比较特殊
    NSArray *titleArr = @[@"编织方式",@"组织",@"工艺",@"弹力",@"回位",@"印染工艺",@"应用",@"图案",@"衣长",@"廓形",@"腰型",@"领型",@"面料",@"材质",@"风格",@"季节",@"袖长",@"门幅",@"克重",@"分辨率",@"成分"];
    NSLog(@"%ld",(long)titleArr.count);
    
    NSArray *unitArr;
    
    NSInteger index = [titleArr  indexOfObject:unitName];

    switch (index) {
        case 0:{
            //编织方式
           unitArr = @[@"梭织",@"针织",@"混纺",@"无纺"];
            break;
        }
        case 1:{
            //组织
            unitArr = @[@"平纹",@"2/1斜纹",@" 3/1斜纹",@"双面斜",@"灯心绒",@"人字斜",@"直贡",@"横贡",@"方格",@"双层",@"提花"];
            break;
        }
        case 2:{
            //工艺
            unitArr = @[@"印花",@"色织",@"绣花",@"提花",@"磨毛",@"水洗",@"镂空",@"褶皱",@"染色",@"胶印",@"拉毛",@"植绒",@"涂层",@"压花",@"复合",@"扎染",@"烫金",@"烫银",@"烂花",@"烧花",@"/金葱",@"银葱",@"精纺",@"撒金",@"烫钻",@"漂白",@"顺纡",@"贴布绣",@"做旧",@"烫片",@"3D印花",@"钉珠",@"砂洗",@"热转印",@"半精纺",@"粗纺",@"磨砂",@"冲孔",@"剪毛",@"拔毛",@"褪色",@"烫图"];
            break;
        }
        case 3:{
            //弹力
            unitArr = @[@"无弹",@"经弹",@"维弹",@"四面弹",@"高弹纤维"];
            break;
        }
        case 4:{
            //回位
             unitArr = @[@"四方连续",@"尔方连续",@"独幅"];
            break;
        }
        case 5:{
            //印染工艺
            unitArr = @[@"数码印花",@"仿数码印花",@"纸转移印花",@"吊印印花",@"圆网印花",@"平网印花"];
            break;
        }
        case 6:{
            //应用
            unitArr = @[@"女装",@"男装",@"童装",@"泳装",@"床品",@"窗帘",@"沙发布",@"丝巾",@"箱包"];
            break;
        }
        case 7:{
            //图案
            unitArr = @[@"抽象",@"动物纹",@"格子",@"花卉",@"几何",@"卡通",@"民族风",@"佩斯利",@"风景",@"休闲风",@"条纹",@"珠宝宝石",@"热带",@"趣味",@"迷彩",@"鸟",@"昆虫"];
            break;
        }
        case 8:{
            //衣长
            unitArr = @[@"短款",@"中长款",@"长款"];
            break;
        }
        case 9:{
            //廓形
            unitArr = @[@"A型",@"O型",@"T型",@"H型",@"V型",@"X型",@"Y型"];
            break;
        }
        case 10:{
            //腰型
            unitArr = @[@"中腰",@"高腰",@"宽松腰",@"松紧腰"];
            break;
        }
        case 11:{
            //领型
            unitArr = @[@"圆领",@"V领",@"立领",@"POLO领"];
            break;
        }
        case 12:{
            //面料
            unitArr = @[@"牛仔",@"呢料",@"雪纺",@"真丝",@"欧根纱",@"印花",@"绣花",@"针织",@"皮草",@"莫代尔",@"棉麻",@"全棉",@"天丝",@"丝绵",@"亚麻",@"竹纤维",@"老粗布",@"法兰绒",@"仿真丝",@"天鹅绒",@"珊瑚绒"];
            break;
        }
        case 13:{
            //材质
            unitArr = @[@"金属",@"树脂",@"塑料",@"尼龙",@"木质",@"象牙",@"玳瑁",@"涤纶",@"玻璃",@"亚克力",@"皮",@"毛",@"革",@"果实",@"植物",@"麻",@"纸质",@"水晶",@"棉",@"纤维",@"人造丝",@"低弹丝",@"乳胶丝",@"记忆棉",@"天然乳胶",@"竹炭",@"椰棕",@"海绵"];
            break;
        }
        case 14:{
            //风格
             unitArr = @[@"休闲",@"通勤",@"田园",@"民族",@"复古",@"异域",@"朋克",@"摇滚",@"浪漫",@"清新",@"日式",@"简约"];
            break;
        }
        case 15:{
            //季节
            unitArr = @[@"春",@"夏",@"秋",@"冬"];
            break;
        }
        case 16:{
            //袖长
             unitArr = @[@"长袖",@"无袖",@"短袖",@"七分袖",@"五分袖"];
            break;
        }
        case 17:{
            //门幅
            unitArr = @[@"厘米",@"公分",@"英寸",@"码",@"米"];
            break;
        }
        case 18:{
            //克重
            unitArr = @[@"克/㎡",@"公斤/米",@"姆米",@"盎司/㎡",@"盎司/米",@"盎司/码",@"磅/㎡",@"磅/码",@"磅/米"];
            break;
        }
        case 19:{
            //分辨率
            unitArr = @[@"长袖",@"无袖",@"短袖",@"七分袖",@"五分袖"];
            break;
        }
        case 20:{
            //成分
            unitArr = @[@"棉",@"亚麻",@"真丝",@"尼龙",@"羊绒",@"蚕丝",@"涤纶",@"兔毛",@"羊毛",@"其它"];
            break;
        }
        default:
            break;
    }
  
    
    
    
    
    return unitArr;
}










@end
